#![allow(non_snake_case)]
#![allow(non_upper_case_globals)]

sada::sada! {
    خارِجي صندوق sada;

    استخدم std::collections::قاموس ك قاموسي;

    سمه مفتاح_القيمة {
        دالة اكتب(&ذات, مفتاح: نص, قيمة: نص);
        دالة اقرأ(&ذات, مفتاح: نص) -> نتيجة<خيار<&نص>, نص>;
    }

    لا_حركة متغير قاموس: خيار<قاموسي<نص, نص>> = لا_شيء;

    بنية محددة;

    تنفيذ مفتاح_القيمة ل محددة {
        دالة اكتب(&ذات, مفتاح: نص, قيمة: نص) {
            دع قاموسي = غير_امن {
                قاموس.خذ_او_ادخل_ب(افتراضي::طبيعي)
            };
            قاموسي.ادخل(مفتاح, قيمة);
        }

        دالة اقرأ(&ذات, مفتاح: نص) -> نتيجة<خيار<&نص>, نص> {
            اذا دع بعض(قاموسي) = غير_امن { قاموس.ك_مرجِع() } {
                حسنا(قاموسي.جلب(&مفتاح))
            } آخر {
                خطأ("لا يمكن جلب القاموس".إلى())
            }
        }
    }

    عام(صندوق) دالة يمكن_أن_يكون(د: u32) -> خيار<نتيجة<u32, نص>> {
        اذا د % 2 == 1 {
            اذا د == 42 {
                بعض(خطأ(نص::من("هلع")))
            } آخر {
                بعض(حسنا(33))
            }
        } آخر {
            لا_شيء
        }
    }

    غير_متزامنة دالة مثال() {
    }

    غير_متزامنة دالة مثال2() {
        مثال().انتظر;
    }

    دالة رئيسي() {
        دع متغير ص = 31;

        طابق ص {
            42 => {
                اطبع!("مدري")
            }
            _ => اطبع!("والله صعبة يا شباب")
        }

        ل د في 0..10 {
            دع الفار = حلقه {
                كسر د;
            };

            بينما ماذا ص < الفار {
                ص += 1;
            }

            ص = اذا دع بعض(نتيجة) = يمكن_أن_يكون(ص) {
                نتيجة.فك()
            } آخر {
                12
            };
        }

    }

    #[اسمح(كود_بعيد_المنال)]
    دالة ثانوية() {
        هلع!("نجرب");
    }
}
